{
    "About US": "ÜBER UNS",
    "About Us": "Unternehmen",
    "Easy Move Europe is a online digital platform that connects companies and private persons to a huge van network, simplifying and making relocation of personal and business assets affordable.": "Easy Move Europe ist eine digitale Online-Plattform, die Unternehmen und Privatpersonen mit einem riesigen Van-Netzwerk verbindet und die Verlagerung von persönlichen und geschäftlichen Vermögenswerten vereinfacht und erschwinglich macht.",
    "It all came about when the company founder entered the US domestic moving business. After working 4 years in the sector, he moved to Romania, where he rejoined another transport company and acquired even more expertise in this business. After a few more years and being frustrated by the way companies failed to provide a high quality service and seeing a great opportunity there, he decided to let his entrepreneurial side speak louder and start his own business. There, Easy move Europe was born.": "Alles kam zustande, als der Firmengründer in das inländische Umzugsgeschäft in den USA eintrat. Nachdem er 4 Jahre in der Branche gearbeitet hatte, zog er nach Rumänien, wo er zu einem anderen Transportunternehmen zurückkehrte und noch mehr Know-how in diesem Geschäft erwarb. Nach ein paar Jahren und frustriert von der Art und Weise, wie Unternehmen keinen qualitativ hochwertigen Service erbringen und eine großartige Gelegenheit sehen, beschloss er, seine unternehmerische Seite lauter sprechen zu lassen und sein eigenes Unternehmen zu gründen. Dort wurde Easy Move Europe geboren.",
    "We are currently able to meet any existing demand and the more than 37,000 vans that are part of our network give us the ability to offer our customers the best prices without compromising on quality. To support all of this we have a team of experts who really do what they love and are adequately compensated so they can go beyond the obvious.": "Wir sind derzeit in der Lage, jede bestehende Nachfrage zu befriedigen, und die mehr als 37.000 Lieferwagen, die Teil unseres Netzwerks sind, geben uns die Möglichkeit, unseren Kunden die besten Preise zu bieten, ohne Kompromisse bei der Qualität einzugehen. Um all dies zu unterstützen, haben wir ein Team von Experten, die wirklich tun, was sie lieben, und angemessen vergütet werden, damit sie über das Offensichtliche hinausgehen können.",
    "\"In business and relationships, my rule is to act with others the way we would like others to act with me, because that way we will always be fair”": "„In Geschäftsbeziehungen ist es meine Regel, mit anderen so zu handeln, wie wir es uns wünschen, denn auf diese Weise werden wir immer fair sein.“",
    "James Kaljes (Founder and CO of Easy move Europe)": "James Kaljes (Gründer und CO von Easy Move Europe)",
    "Vans across Europe": "Europas.",
    "Logistics experts": "Logistikexperten",
    "Years of experience": "Langjährige Erfahrung",
    "Happy clients": "Zufriedene Kunden"
}